In [5]:
import pandas as pd
import numpy as np

In [6]:
df_Measure=pd.read_csv('Instructions/Resources/hawaii_measurements.csv')
print(len(df_Measure))
df_Measure.head()

19550

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [7]:
df_Station=pd.read_csv('Instructions/Resources/hawaii_stations.csv')
df_Station.head()

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7.0
3,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [8]:
df_Measure1 = df_Measure.dropna()
print(len(df_Measure1))
df_Measure1.head()

18103

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
5  USC00519397  2010-01-07  0.06    70

In [9]:
null_data_Measure = df_Measure1[df_Measure1.isnull().any(axis=1)]
print(len(null_data_Measure))

0

In [10]:
df_Station1 = df_Station.dropna()
print(len(df_Station1))
df_Station1.head()

9

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,USC00513117,"KANEOHE 838.1, HI US",21.4234,-157.8015,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.5213,-157.8374,7.0
3,USC00517948,"PEARL CITY, HI US",21.3934,-157.9751,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.4992,-158.0111,306.6

In [11]:
null_data_Station = df_Station1[df_Station1.isnull().any(axis=1)]
print(len(null_data_Station))

0

In [12]:
df_Measure1.to_csv('Instructions/Resources/Clean_hawaii_measurements.csv')

In [13]:
df_Station1.to_csv('Instructions/Resources/Clean_hawaii_stations.csv')

In [14]:
import sqlalchemy
from sqlalchemy import create_engine, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float, ForeignKey
from sqlalchemy.orm import sessionmaker, relationship

In [15]:
Base = declarative_base()
 
class Measurement(Base):
    __tablename__ = 'Measurement'
    # Here we define columns for the table Measurement
   
    id = Column(Integer, primary_key=True)
    station = Column(String(250))
    date = Column(String(250))
    prcp = Column(Float)
    tobs = Column(Float)
    

class Station(Base):
    __tablename__ = 'Station'
    # Here we define columns for the table Station.
    id = Column(Integer, primary_key=True)
    station = Column(String(250))
    name = Column(String(250))
    latitude = Column(Float)
    longitude = Column(Float)
    elevation = Column(Float)
 
# Create an engine that stores data in the local directory's
# sqlalchemy_example.db file.
engine = create_engine('sqlite:///Hawaii_db.sqlite')
 
# Create all tables in the engine. This is equivalent to "Create Table"
# statements in raw SQL.
Base.metadata.create_all(engine)

In [18]:
def insert_record_table(engine, table, csvfile):
    
     conn = engine.connect()
     df_insert_data = pd.read_csv(csvfile)
     data = df_insert_data.to_dict(orient='records')
     conn.execute(table.insert(), data)
    

insert_record_table(engine, Station.__table__, 'Instructions/Resources/Clean_hawaii_stations.csv')
insert_record_table(engine, Measurement.__table__, 'Instructions/Resources/Clean_hawaii_measurements.csv')

In [19]:
engine.execute("SELECT * FROM measurement LIMIT 1").fetchall()

[(1, 'USC00519397', '2010-01-01', 0.08, 65.0)]

In [20]:
engine.execute("SELECT * FROM station LIMIT 1").fetchall()

[(1, 'USC00519397', 'WAIKIKI 717.2, HI US', 21.2716, -157.8168, 3.0)]